app/controllers/box_controller.rb

  def index
    @boxes = Box.all.order(id: :desc)
    @box_owners = BoxOwner.all.order(id: :desc).map {|o| {value: o.id, label: o.email} }
---
SELECT "boxes".* FROM "boxes" ORDER BY "boxes"."id" DESC
SELECT "box_owners"."id", "box_owners"."email" FROM "box_owners" ORDER BY "box_owners"."id" DESC

  def attach_box_owner
    box_owner = params[:box_owner]
    id = params[:box].require(:id)
    begin
      if Box.find(id).update(box_owners_id: box_owner)
---
SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "boxes" SET "box_owners_id" = ?, "label" = ?, "updated_at" = ? WHERE "boxes"."id" = ?

  def ajax_post
    size = params[:size]
    label = params.require(:label)
    open = params.require(:open)
    if Box.create({size: size, label: label, open: open})
---
INSERT INTO "boxes" ("size", "label", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["size", "small"], ["label", "20"], ["created_at", "2021-04-27 15:16:00.892209"], ["updated_at", "2021-04-27 15:16:00.892209"]]

  def ajax_delete
    id = params.require(:id)

    if Box.find(id).destroy
---
DELETE FROM "boxes" WHERE "boxes"."id" = ?  [["id", 1]]
SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]