app/controllers/box_owners_controller.rb

  def index
    @box_owners = BoxOwner.all.order(id: :desc)
---
SELECT "box_owners".* FROM "box_owners" ORDER BY "box_owners"."id" DESC

  def create
    @box_owner = BoxOwner.new(box_owner_params)

    if @box_owner.save!
---
INSERT INTO "box_owners" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    if @box_owner.destroy
---
DELETE FROM "box_owners" WHERE "box_owners"."id" = ?  [["id", 1]]

    def set_box_owner
      @box_owner = BoxOwner.find(params[:id])
---
SELECT  "box_owners".* FROM "box_owners" WHERE "box_owners"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]